app/controllers/api/v1/phonenumbers_controller.rb

 def create
   if Phonenumber.new(phonenumber_params).save
---
INSERT INTO "phonenumbers" ("phonenumber", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phonenumber", 1111111111], ["user_id", 14], ["created_at", "2022-04-19 13:07:16.045546"], ["updated_at", "2022-04-19 13:07:16.045546"]]