app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "encrypted_password") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "user_api_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_api_token", "eyJhbGciOiJIUzI1NiJ9.eyJpZCI6MTQsImV4cCI6MTY1NTU1NzUzNn0.5H26j5RXiNdHbd-XELFh9NubS9MzGikzN0UI9wJTP3k"], ["updated_at", "2022-04-19 13:05:36.783213"], ["id", 14]]
---
  def create_user_api_token
    user = User.find_by_email(params[:user][:email])
    user_api_token = User.generate_user_api_token user[:id]
    user.update_attribute(:user_api_token,user_api_token)